tutorials/conjugateHeatTransfer/coolingSphere/reactingFluid/0/solid/T
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          T;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 1 0 0 0];

internalField   uniform 396;

boundaryField
{
    solid_to_fluid
    {
        type                    regionCoupledHeatFlux;
        interfaceType           heatTransferInterface;
        k                       "k";
        neighbourRegionName     fluid;
        neighbourPatchName      fluid_to_solid;
        neighbourFieldName      T;
        secondOrder             false;
        nonOrthCorr             true;
        value                   $internalField;
    }
}

// ************************************************************************* //
