tutorials/conjugateHeatTransfer/coolingSphere/reactingFluid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libcompressibleRASModels.so"
    "liblduSolvers.so"
)

application 		multiRegionFoam;
startFrom       	startTime;
startTime       	0;
stopAt          	endTime;
endTime         	10;
deltaT          	5E-3;
writeControl    	runTime;
writeInterval   	0.1;
purgeWrite      	0;
writeFormat     	ascii;
writePrecision  	6;
writeCompression 	uncompressed;
timeFormat      	general;
timePrecision   	10;
runTimeModifiable 	no;
maxCo			    10;
maxDeltaT		    1;
		
functions
(
    massflow1
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        region          fluid;
        enabled         true;
        outputControl   outputTime;

        // Output to log&file (true) or to file only
        log             true;

        // Output field values as well
        valueOutput     true;

        // Output value format
        surfaceFormat   foamFile;

        // Type of source: patch/faceZone/sampledSurface
        source          patch;

        // if patch or faceZone: name of patch or faceZone
        sourceName      inlet;

        // Operation: areaAverage/sum/weightedAverage ...
        operation       sum;

        fields
        (
           phi
           h
        );
    }
    
    massflow2
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        region          fluid;
        enabled         true;
        outputControl   outputTime;

        // Output to log&file (true) or to file only
        log             true;

        // Output field values as well
        valueOutput     true;

        // Output value format
        surfaceFormat   foamFile;

        // Type of source: patch/faceZone/sampledSurface
        source          patch;

        // if patch or faceZone: name of patch or faceZone
        sourceName      outlet;

        // Operation: areaAverage/sum/weightedAverage ...
        operation       sum;

        fields
        (
           phi
           h
        );
    }

    heatFlux1
    {
        type               heatFlux;
	functionObjectLibs ("libsimpleFunctionObjects.so");
        region             fluid;
        enabled            true;
        outputControl      outputTime;
        K                  kappaEff;
        log                true;
        valueOutput        true;
        surfaceFormat      foamFile;
        
    }
    
    heatFlux2
    {
        type               heatFlux;
	functionObjectLibs ("libsimpleFunctionObjects.so");
        region             solid;
        enabled            true;
        outputControl      outputTime;
	log		   true;
        K                  k;
        log                true;
        valueOutput        true;
        surfaceFormat      foamFile;
    }

    faceAverageInlet
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        region          fluid;
        enabled         true;
        outputControl   outputTime;

        // Output to log&file (true) or to file only
        log             true;

        // Output field values as well
        valueOutput     true;

        // Output value format
        surfaceFormat   foamFile;

        // Type of source: patch/faceZone/sampledSurface
        source          patch;

        // if patch or faceZone: name of patch or faceZone
        sourceName      inlet;

        // Operation: areaAverage/sum/weightedAverage ...
        operation       areaAverage;

        fields
        (
            p
            T
            U
            k
            kappaEff
            mu
            mut
            alpha
            alphat
            nu
            nut
            rho
            cp
        );
    }

    faceAverageOutlet
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        region          fluid;
        enabled         true;
        outputControl   outputTime;

        // Output to log&file (true) or to file only
        log             true;

        // Output field values as well
        valueOutput     true;

        // Output value format
        surfaceFormat   foamFile;

        // Type of source: patch/faceZone/sampledSurface
        source          patch;

        // if patch or faceZone: name of patch or faceZone
        sourceName      outlet;

        // Operation: areaAverage/sum/weightedAverage ...
        operation       areaAverage;

        fields
        (
            p
            T
            U
            k
            kappaEff
            mu
            mut
            alpha
            alphat
            nu
            nut
            rho
            cp
        );
    }
    
    faceAverageSphere
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        region          fluid;
        enabled         true;
        outputControl   outputTime;

        // Output to log&file (true) or to file only
        log             true;

        // Output field values as well
        valueOutput     true;

        // Output value format
        surfaceFormat   foamFile;

        // Type of source: patch/faceZone/sampledSurface
        source          patch;

        // if patch or faceZone: name of patch or faceZone
        sourceName      fluid_to_solid;

        // Operation: areaAverage/sum/weightedAverage ...
        operation       areaAverage;

        fields
        (
            T
            k
            kappaEff
            alpha
            alphat
            nu
            nut
            mu
            mut
        );
    }

    volAverageFluid
    {
        type            cellSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        region          fluid;

        enabled         true;

        outputControl   outputTime;
        log             true;
        valueOutput     true;

        source          all;
        operation       volAverage;

        fields
        (
            p
            T
            U
            k
            kappaEff
            mu
            mut
            alpha
            alphat
            nu
            nut
            rho
            cp
        );
    }

    volAverageSolid
    {
        type            cellSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        region          solid;
        enabled         true;
        outputControl   outputTime;
        log             true;
        valueOutput     true;
        source          all;
        operation       volAverage;

        fields
        (
            T
        );
    }
);

// ************************************************************************* //
